app/views/followers/_form.html.erb

  <ul>
    <% user_to_follow.boards.each do |board| %>
---
SELECT "boards".* FROM "boards" WHERE "boards"."user_id" = $1  [["user_id", 1]]