app/views/followers/index.html.erb

           <td><%= follower.user.full_name%></td>
           <% @user = User.find(follower.follower_id)   %>
---
SELECT  "users".* FROM "users" WHERE (id=38)  ORDER BY "users"."id" ASC LIMIT 1
SELECT "followers".* FROM "followers" WHERE (follower_id=38)