app/controllers/boards_controller.rb

  def index
      #@boards = Board.all
      @boards = current_user.boards.all
---
SELECT "boards".* FROM "boards" WHERE "boards"."user_id" = $1  [["user_id", 36]]

  def show
      @board = current_user.boards.find(params[:id])
---
SELECT  "boards".* FROM "boards" WHERE "boards"."user_id" = $1 AND "boards"."id" = $2 LIMIT 1  [["user_id", 36], ["id", 1]]

  def create
       @board = current_user.boards.new(board_params)

    respond_to do |format|
      if @board.save
---
INSERT INTO "boards" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "My pins"], ["user_id", 0], ["created_at", "2016-08-11 17:29:50.805732"], ["updated_at", "2016-08-11 17:29:50.805732"]]

  def update
    respond_to do |format|
      if @board.update(board_params)
---
UPDATE "boards" SET "name" = $1, "updated_at" = $2 WHERE "boards"."id" = $3  [["name", "Rails"], ["updated_at", "2016-09-04 04:19:22.964872"], ["id", 41]]

    def set_board
      @board = Board.find(params[:id])
---
SELECT  "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT 1  [["id", 52]]