app/controllers/followers_controller.rb

  def index
    @followers = Follower.all
---
SELECT "followers".* FROM "followers" WHERE (follower_id=38)

  def create
    @follower = Follower.new(follower_params)

    respond_to do |format|
      if @follower.save
---
INSERT INTO "followers" ("user_id", "follower_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["follower_id", 38], ["created_at", "2016-09-01 03:11:12.775532"], ["updated_at", "2016-09-01 03:11:12.775532"]]

    def set_follower
      @follower = Follower.find(params[:id])
---
SELECT "followers".* FROM "followers" WHERE (follower_id=38)