app/controllers/pins_controller.rb

SELECT  "pins".* FROM "pins" WHERE "pins"."user_id" = $1 LIMIT 1  [["user_id", 28]]
---
  def index
     @pins = current_user.pins.all