app/controllers/pins_controller.rb

  def index
      #@pins = current_user.pins.all
      #Displays all pins
      @pins = Pin.all
---
SELECT "pins".* FROM "pins"

  def show
    @pin = Pin.find(params[:id])
    #set @users to the pin's users.
    @users = @pin.users
    @board = @pin.pinnings.find_by(params[board_id: @user.boards, user_id: @user.id])
---
SELECT  "pins".* FROM "pins" WHERE "pins"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "boards".* FROM "boards" WHERE "boards"."user_id" = $1  [["user_id", 36]]
SELECT "users".* FROM "users" INNER JOIN "pinnings" ON "users"."id" = "pinnings"."user_id" WHERE "pinnings"."pin_id" = $1  [["pin_id", 42]]

  def show_by_name
      #search for a Pin using the slug you grab from the URL/using a named url instead of the id
      @pin = Pin.find_by_slug(params[:slug])
      #set @users to the pin's users.
      @users = User.joins(:pinnings).where("users.id = ? or pinnings.pin_id = ?", @pin.user_id, @pin.id).distinct #@users = Pin.find_by_slug(params[:slug]).users
---
SELECT  "pins".* FROM "pins" WHERE "pins"."slug" = $1 LIMIT 1  [["slug", "rails-tutorial"]]
SELECT DISTINCT "users".* FROM "users" INNER JOIN "pinnings" ON "pinnings"."user_id" = "users"."id" WHERE (users.id = 38 or pinnings.pin_id = 68)

  def edit
      @pin = Pin.find(params[:id])
      @boards = @pin.pinnings.find_by(params[board_id: @user.boards, user_id: @user.id])
---
SELECT  "pins".* FROM "pins" WHERE "pins"."id" = $1 LIMIT 1  [["id", 9]]
SELECT "boards".* FROM "boards" WHERE "boards"."user_id" = $1  [["user_id", 38]]

  def create
     @pin = current_user.pins.new(pin_params)

      if @pin.valid?
           @pin.save
---
INSERT INTO "pins" ("title", "url", "slug", "text", "category_id", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "the rails"], ["url", "http://skillcrush.com"], ["slug", "the-rails"], ["text", "tests, tests, tests, tests"], ["category_id", 2], ["user_id", 28]]

  def update
     @pin = Pin.pinnings.find_by(params[:id, board_id: @user.boards, user_id: @user.id])
     @pin.pinnings.update_attributes(pin_params)
---
UPDATE "pins" SET "slug" = $1 WHERE "pins"."id" = $2  [["slug", "i-love-to-learn-rails"], ["id", 71]]

  def repin
     @pin = Pin.find(params[:id])
     Pinning.create(user_id: current_user, pin_id: @pin.id, board_id: params[:pin][:pinning][:board_id])
---
SELECT  "pins".* FROM "pins" WHERE "pins"."id" = $1 LIMIT 1  [["id", 38]]
INSERT INTO "pinnings" ("user_id", "pin_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 34], ["pin_id", 38], ["created_at", "2016-04-21 22:54:24.901289"], ["updated_at", "2016-04-21 22:54:24.901289"]]