app/controllers/pins_controller.rb

  def create
      @pin = current_user.pins.new(pin_params)


      if @pin.valid?
           @pin.save
           #puts Pinning.inspect
           Pinning.create(user_id: current_user, pin_id: @pin.id, board_id: params[:pin][:pinning][:board_id])
---
INSERT INTO "pinnings" ("user_id", "board_id", "pin_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 38], ["board_id", 49], ["pin_id", 52], ["created_at", "2016-08-17 22:51:26.433963"], ["updated_at", "2016-08-17 22:51:26.433963"]]

 def update
    @pin = Pin.find(params[:id])
---
SELECT  "pins".* FROM "pins" WHERE "pins"."id" = $1 LIMIT 1  [["id", 71]]