app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT  "users".* FROM "users" WHERE (id=38)  ORDER BY "users"."id" ASC LIMIT 1

  def create
    @user = User.new(user_params)
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
      @user = User.find(params[:id])
      @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE (id=7)  ORDER BY "users"."id" ASC LIMIT 1
UPDATE "users" SET "first_name" = $1, "last_name" = $2, "password_digest" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["first_name", "ben"], ["last_name", "carson"], ["password_digest", "$2a$10$FnJu3J8fVCuZqXP/ONa/F./zpkUL1PPSYqZh1ZS68j9O2Xiry09zm"], ["updated_at", "2016-03-13 06:09:03.799196"], ["id", 16]]

    def set_user
      @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE (id=NULL)  ORDER BY "users"."id" ASC LIMIT 1